Revit 2026 API

# ExporterIFCUtilsGetUnscaledTransformWithoutFixOfDirection Method

---

Obtains the unscaled transform from an IfcLocalPlacement handle without fix of direction.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Transform GetUnscaledTransformWithoutFixOfDirection(
	ExporterIFC exporterIFC,
	IFCAnyHandle placement
)
```
```vb
Public Shared Function GetUnscaledTransformWithoutFixOfDirection (
	exporterIFC As ExporterIFC,
	placement As IFCAnyHandle
) As Transform
```
```cpp
public:
static Transform^ GetUnscaledTransformWithoutFixOfDirection(
	ExporterIFC^ exporterIFC,
	IFCAnyHandle^ placement
)
```
```fsharp
static member GetUnscaledTransformWithoutFixOfDirection :
        exporterIFC : ExporterIFC *
        placement : IFCAnyHandle -> Transform
```

#### Parameters

exporterIFC ExporterIFC
     The exporter.
placement IFCAnyHandle
     The placement handle.

#### Return Value

Transform The transform.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace